app/controllers/profiles_controller.rb

  def create
    @profile = current_user.profiles.new(profile_params)
    if @profile.save!
---
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2015-11-02 21:40:48.215377"], ["updated_at", "2015-11-02 21:40:48.215377"]]